---
kind: other
id: Properties.T:Autodesk.Revit.DB.PointLocationOnCurve
source: html/f0d1451f-7f6e-eda2-e2a5-5d7ecacf1bcc.htm
---
# PointLocationOnCurve Properties

Specifies whether the .NET object represents a valid Revit entity.